

;  //////////////////////
;  //     Phalanx      //
;  //////////////////////

[WOTC_APA_Phalanx X2SoldierClassTemplate]
DisplayName = "方阵兵"
ClassSummary = "通过盾牌来保护自己或他人，使用盾墙/蹲下，方阵兵擅长固守阵地或冲向其他单位无法安全抵达的目标。<br/><br/><font color='#CA7200'>可以使用手枪和弹道盾牌。</font>"
+AbilityTreeTitles = "高塔"
+AbilityTreeTitles = "弹道"
+AbilityTreeTitles = "防御者"
+AbilityTreeTitles = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"

+RandomNickNames = "Blitz"
+RandomNickNames = "Brick"
+RandomNickNames = "Butcher"
+RandomNickNames = "Buzzsaw"
+RandomNickNames = "Cajun"
+RandomNickNames = "Chops"
+RandomNickNames = "Cobra"
+RandomNickNames = "Crash"
+RandomNickNames = "Diamond"
+RandomNickNames = "Enforcer"
+RandomNickNames = "Flash"
+RandomNickNames = "Fury"
+RandomNickNames = "Gator"
+RandomNickNames = "Icepick"
+RandomNickNames = "Jaws"
+RandomNickNames = "Knuckles"
+RandomNickNames = "Monster"
+RandomNickNames = "Mustang"
+RandomNickNames = "Pitbull"
+RandomNickNames = "Predator"
+RandomNickNames = "Razor"
+RandomNickNames = "Roman"
+RandomNickNames = "Samurai"
+RandomNickNames = "Scorpion"
+RandomNickNames = "Shogun"
+RandomNickNames = "Slayer"
+RandomNickNames = "Steel"
+RandomNickNames = "Terminator"
+RandomNickNames = "Thane"
+RandomNickNames = "Trojan"
+RandomNickNames = "Vandal"
+RandomNickNames = "Viking"
+RandomNickNames = "Warden"
+RandomNickNames = "Warlord"
+RandomNickNames = "Wolf"
+RandomNickNames = "Wolverine"
+RandomNicknames_Female = "Athena"
+RandomNicknames_Female = "Iron Maiden"
+RandomNicknames_Female = "Shieldmaiden"
+RandomNicknames_Female = "Valkyrie"
+RandomNicknames_Female = "Godmother"
+RandomNickNames_Male = "Axeman"
+RandomNickNames_Male = "Rocky"
+RandomNickNames_Male = "Stallion"
+RandomNickNames_Male = "Wolfman"

+PhotoboothSoloBLines_Female = "Let her take you under her iron wing."
+PhotoboothSoloBLines_Female = "Her shield will bring ABSOLUTE JUSTICE!"
+PhotoboothSoloBLines_Female = "Tough, Dependable, and UNBREAKABLE."

+PhotoboothSoloBLines_Male = "Let him take you under his iron wing."
+PhotoboothSoloBLines_Male = "His shield will bring ABSOLUTE JUSTICE!"
+PhotoboothSoloBLines_Male = "Tough, Dependable, and UNBREAKABLE."

; - Encyclopedia Entry -

[WOTC_APA_Phalanx X2EncyclopediaTemplate]
ListTitle = "方阵兵职业"
DescriptionTitle = "方阵兵职业"
DescriptionEntry = "使用盾牌来保护自己或他人，方阵兵可以用来突袭其他单位无法安全抵达的目标，或者用坚固的盾牌和可靠的手枪固守战线。" 




;***************************************
;GTS Unlocks Descriptions
;***************************************
; - GTS Unlocks -

[WOTC_APA_PhalanxUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "方阵兵：强化护甲 I"
Summary = "所有方阵兵的先锋熟练度现在将开始于等级 2，无论军衔。"

[WOTC_APA_PhalanxUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "方阵兵：强化护甲 II"
Summary = "所有方阵兵的先锋熟练度现在将开始于等级 3，无论军衔。<br/><br/><font color='#CA7200'>需要强化护甲 I</font>"



;***************************************
;New Ability Descriptions
;***************************************

[WOTC_DP_Vanguard X2AbilityTemplate]
LocFriendlyName = "方阵先锋"
LocHelpText = "方阵兵通过经验学习提高他们的防御能力。"
LocLongDescription = "方阵兵通过经验学习提高他们的防御能力。"
LocPromotionPopupText="<font color='#CA7200'>等级 I</font>  (在 <Ability:RANKNAME1/> 军衔 [1] 获得)<br/><Bullet/> 护盾生命值 + 1<br/><Bullet/> 获得完美防御 - 当盾墙生效时，获得 +<Ability:PERFECTGUARD_ARMOR_BONUS/> 护甲加成。同时获得爆炸装甲能力，这将减少爆炸伤害，对自身和盟友在 <Ability:DPBLASTPLATING_RADIUS/> 格内的爆炸伤害  <Ability:DPGUARD_EXPLOSIVE_DAMAGE_MULTIPLIER/> <br/><br/><font color='#CA7200'>等级 II</font>  (在 <Ability:RANKNAME3/> 军衔 [3] 获得)<br/><Bullet/>护盾生命值 + 2  <br/><Bullet/>获得适应性合金装甲能力 - 获得 <font color='#3ABD23'>+<Ability:ADAPTIVE_PLATING_ARMOR/></font> 点可再生标准护甲。同时获得盾牌创伤能力，使用盾牌进行近战攻击，使对手眩晕并停滞1个动作。 <br/><br/><font color='#CA7200'>LEVEL III</font>  (在 <Ability:RANKNAME6/> 军衔 [6] 获得)<br/><Bullet/> 护盾生命值 + 2  <br/><Bullet/> 获得无懈可击防御 - 当盾墙激活时，无法被敌人一击必杀。"

[DPTaunt X2AbilityTemplate]
LocFriendlyName="嘲讽"
LocLongDescription="尝试吸引敌人的火力朝向你。防御减少 45，闪避增加 55。免费行动。不会结束回合。"
LocHelpText="尝试吸引敌人的火力朝向你。防御减少 45，闪避增加 55。"
LocFlyOverText="嘲讽以轻蔑的意图"
LocPromotionPopupText="<Bullet/>特别适合装备高护甲的士兵，以减轻即将到来的伤害。<br/><Bullet/>它也不会与命中或蹲伏产生互动。"

[DPPistolExpert X2AbilityTemplate]
LocFriendlyName="手枪专家"
LocLongDescription="所有手枪射击的伤害增加，并且命中率和造成暴击的概率也有所提高。"
LocHelpText="所有手枪攻击的额外伤害、瞄准和暴击概率。"
LocFlyOverText="手枪专家"
LocPromotionPopupText="<Bullet/> 枪专家的加成会随着武器技术等级的提升而变化。<br/><Bullet/> 手枪专家使得每发手枪射击都有 <ABILITY:BONUSDMGCV/>/<ABILITY:BONUSDMGMG/>/<ABILITY:BONUSDMGBM/> 的额外伤害， <ABILITY:BONUSAIMCV/>/<ABILITY:BONUSAIMMG/>/<ABILITY:BONUSAIMBM/> 的额外瞄准，以及  <ABILITY:BONUSCRITCV/>/<ABILITY:BONUSCRITMG/>/<ABILITY:BONUSCRITBM/> 的额外暴击概率，取决于武器等级。<br/>"

[DPGuard X2AbilityTemplate]
LocFriendlyName="方阵防御"
LocLongDescription="激活以防御下一个即将到来的攻击，减少其效果。可以多次使用以防御多个攻击。可以与仅移动行动一起使用。如果携带 <font color='#0bff9b'>弹道盾牌</font>，则在没有攻击本回合的情况下自动使用。"
LocHelpText="防御下一个即将到来的攻击，减少其效果。"
LocPromotionPopupText="<Bullet/> 方阵防御会降低敌人攻击的有效性，将它们的伤害结果降级：如果攻击会暴击，它将降级为普通命中。命中将降级为擦伤，而擦伤（闪避）将完全不会击中士兵。<br/><Bullet/>当装备有 <font color='#0bff9b'>弹道盾牌 </font>时，攻击会被降级两次：暴击变为擦伤，普通命中和擦伤（闪避）会被弹开。 <br/><Bullet/> 方阵防御还会减少爆炸伤害，每次使用消耗一个充能。"
LocFlyOverText="方阵防御: "



[DPLightningHands X2AbilityTemplate]
LocFriendlyName="雷霆之手"
LocLongDescription="向目标开枪。这次攻击不消耗行动。"
LocHelpText="向目标开枪。这次攻击不消耗行动。"
LocFlyOverText="雷霆之手"
LocPromotionPopupText="<Bullet/> 雷霆之手可以很好地与其他 <Ability:ClassName/> 能力组合，因为它不会阻止在同一回合使用其他能力。<br/><Bullet/> 雷霆之手有<Ability:SelfCooldown/> 回合的冷却时间。<br/>"

[DP_Blastplating X2AbilityTemplate]
LocFriendlyName="爆炸装甲"
LocFlyOverText="爆炸装甲"
LocLongDescription="在 <Ability:DPBLASTPLATING_RADIUS/> 格内的盟友将受到  <Ability:DPGUARD_EXPLOSIVE_DAMAGE_MULTIPLIER/> 减少的爆炸伤害。被动。"
LocHelpText="在 <Ability:DPBLASTPLATING_RADIUS/> 格内的盟友将受到  <Ability:DPGUARD_EXPLOSIVE_DAMAGE_MULTIPLIER/> 减少的爆炸伤害。被动。"
LocPromotionPopupText="<Bullet/> 在 <Ability:DPBLASTPLATING_RADIUS/> 格内的盟友将受到  <Ability:DPGUARD_EXPLOSIVE_DAMAGE_MULTIPLIER/> reduced damage from explosives <br/><Bullet/> Passive.<br/>"

[DP_Blastplating_Passive X2AbilityTemplate]
LocFriendlyName="爆炸装甲"
LocFlyOverText="爆炸装甲"
LocLongDescription="自己和 <Ability:DPBLASTPLATING_RADIUS/> 格内的盟友将受到  <Ability:DPGUARD_EXPLOSIVE_DAMAGE_MULTIPLIER/> 减少的爆炸伤害。被动。"
LocHelpText="自己和 <Ability:DPBLASTPLATING_RADIUS/> 格内的盟友将受到  <Ability:DPGUARD_EXPLOSIVE_DAMAGE_MULTIPLIER/> 减少的爆炸伤害。被动。"
LocPromotionPopupText="<Bullet/> 自己和 <Ability:DPBLASTPLATING_RADIUS/> 格内的盟友将受到  <Ability:DPGUARD_EXPLOSIVE_DAMAGE_MULTIPLIER/> reduced damage from explosives <br/><Bullet/> Passive.<br/>"
